def bubbleSort(nums):
    for i in range(len(nums) - 1):  # 这个循环负责设置冒泡排序进行的次数
        for j in range(len(nums) - i - 1):  # ｊ为列表下标
            if nums[j] > nums[j + 1]:
                nums[j], nums[j + 1] = nums[j + 1], nums[j]
    return nums


nums = [
           0.65252219, 0.63161394, 0.65252219, 0.58376377, 0.65252219, 0.65252219
           , 0.70480452, 0.65252219, 0.70480452, 0.65252219, 0.65252219, 0.65252219
, 0.67715428, 0.53864218, 0.65252219, 0.65252219, 0.65252219, 0.49547874
, 0.58376377, 0.63161394, 0.64577185, 0.64577185, 0.64577185, 0.64577185
, 0.61037862, 0.60659702, 0.64577185, 0.69367024, 0.63161394, 0.63161394
, 0.65252219
]

def println(nums):
    for i in range(len(nums)):
        print(nums[i])


println(bubbleSort(nums))
